<template>
  <div v-if="showed" class="popup__wrapper !tw-bg-white">
    <div class="tw-flex tw-items-center tw-gap-4 tw-mb-4">
      <span class="tw-grow tw-text-h2 tw-font-bold">
        Правила реферальной программы
      </span>
      <button>
        <base-icon
          @click="emit('close')"
          name="close"
          class="tw-w-6 tw-h-6 tw-text-back tw-mr-0 tw-ml-auto"
        />
      </button>
    </div>
    <div class="tw-whitespace-pre-wrap tw-h-[500px] tw-overflow-x-hidden">
      {{ text }}
    </div>
  </div>
</template>

<script setup lang="ts">
  const showed = defineModel<boolean>({ default: false });

  const emit = defineEmits<{
    (e: 'close'): void
  }>();

  const text = `1. Общие положения
1.1. Реферальная программа (далее — Программа) организована с целью стимулирования привлечения новых пользователей (далее — Рефералов) путем рекомендации услуг (товаров) компании (далее — Организатор).
1.2. Участниками Программы могут стать только зарегистрированные пользователи (далее — Рефереры), достигшие 18 лет и согласившиеся с настоящими Правилами.

2. Условия участия
2.1. Для участия в Программе Реферер должен получить индивидуальную реферальную ссылку или код.
2.2. Рефералы привлекаются Реферером по этой ссылке (коду).

3. Механизм работы
3.1. Реферал должен зарегистрироваться и/или совершить заказ (целевое действие) в системе Организатора, используя реферальную ссылку (код).
3.2. После подтверждения выполнения целевого действия фиксируется факт привлечения.
3.3. Реферер получает вознаграждение, предусмотренное условиями Программы.

4. Вознаграждение
4.1. Размер и форма вознаграждения устанавливаются Организатором и могут выражаться в денежной компенсации, бонусах, скидках или других поощрениях.
4.2. Вознаграждение начисляется только за рефералов, впервые воспользовавшихся услугами (товарами) Организатора.
4.3. Вознаграждение не подлежит передаче третьим лицам и не может быть обменено на денежные средства, если иное не предусмотрено условиями.

5. Ограничения и отказ от участия
5.1. Организатор вправе отказать в выплате вознаграждения при выявлении мошеннических действий со стороны Реферера или Рефералов.
5.2. Программа может быть прекращена или изменена Организатором в одностороннем порядке с предварительным уведомлением участников.

6. Конфиденциальность и обработка данных
6.1. Рефереры и Рефералы согласны на обработку персональных данных в объеме, необходимом для реализации Программы, с соблюдением законодательства о защите персональных данных.

7. Заключительные положения
7.1. Участие в Программе означает полное и безоговорочное согласие с настоящими Правилами.`;
</script>

<style lang="scss" scoped></style>
